DotBots/DotBot-firmware/bsp/nrf52833/lh2.c
uint32_t _reverse_count_p(uint8_t index, uint32_t bits) {
    uint32_t count       = 0;
    uint32_t buffer      = bits & 0x0001FFFFF;  // initialize buffer to initial bits, masked
    uint8_t  ii          = 0;                   // loop variable for cumulative sum
    uint32_t result      = 0;
    uint32_t b17         = 0;
    uint32_t masked_buff = 0;
    while (buffer != _end_buffers[index][0])  // do until buffer reaches one of the saved states
    {
        b17         = buffer & 0x00000001;               // save the "newest" bit of the buffer
        buffer      = (buffer & (0x0001FFFE)) >> 1;      // shift the buffer right, backwards in time
        masked_buff = (buffer) & (_polynomials[index]);  // mask the buffer w/ the selected polynomial
        for (ii = 0; ii < 17; ii++) {
            result = result ^ (((masked_buff) >> ii) & (0x00000001));  // cumulative sum of buffer&poly
        }
        result = result ^ b17;
        buffer = buffer | (result << 16);  // update buffer w/ result
        result = 0;                        // reset result
        count++;
        if ((buffer ^ _end_buffers[index][1]) == 0x00000000) {
            count  = count + 8192 - 1;
            buffer = _end_buffers[index][0];
        }
        if ((buffer ^ _end_buffers[index][2]) == 0x00000000) {
            count  = count + 16384 - 1;
            buffer = _end_buffers[index][0];
        }
        if ((buffer ^ _end_buffers[index][3]) == 0x00000000) {
            count  = count + 24576 - 1;
            buffer = _end_buffers[index][0];
        }
        if ((buffer ^ _end_buffers[index][4]) == 0x00000000) {
            count  = count + 32768 - 1;
            buffer = _end_buffers[index][0];
        }
        if ((buffer ^ _end_buffers[index][5]) == 0x00000000) {
            count  = count + 40960 - 1;
            buffer = _end_buffers[index][0];
        }
        if ((buffer ^ _end_buffers[index][6]) == 0x00000000) {
            count  = count + 49152 - 1;
            buffer = _end_buffers[index][0];
        }
        if ((buffer ^ _end_buffers[index][7]) == 0x00000000) {
            count  = count + 57344 - 1;
            buffer = _end_buffers[index][0];
        }
        if ((buffer ^ _end_buffers[index][8]) == 0x00000000) {
            count  = count + 65536 - 1;
            buffer = _end_buffers[index][0];
        }
        if ((buffer ^ _end_buffers[index][9]) == 0x00000000) {
            count  = count + 73728 - 1;
            buffer = _end_buffers[index][0];
        }
        if ((buffer ^ _end_buffers[index][10]) == 0x00000000) {
            count  = count + 81920 - 1;
            buffer = _end_buffers[index][0];
        }
        if ((buffer ^ _end_buffers[index][11]) == 0x00000000) {
            count  = count + 90112 - 1;
            buffer = _end_buffers[index][0];
        }
        if ((buffer ^ _end_buffers[index][12]) == 0x00000000) {
            count  = count + 98304 - 1;
            buffer = _end_buffers[index][0];
        }
        if ((buffer ^ _end_buffers[index][13]) == 0x00000000) {
            count  = count + 106496 - 1;
            buffer = _end_buffers[index][0];
        }
        if ((buffer ^ _end_buffers[index][14]) == 0x00000000) {
            count  = count + 114688 - 1;
            buffer = _end_buffers[index][0];
        }
        if ((buffer ^ _end_buffers[index][15]) == 0x00000000) {
            count  = count + 122880 - 1;
            buffer = _end_buffers[index][0];
        }
    }
    return count;
}

uint32_t _reverse_count_p3(uint32_t bits) {
    uint32_t count  = 0;
    uint32_t buffer = bits & 0x0001FFFFF;  // initialize buffer to initial bits, masked

    uint8_t  ii          = 0;  // loop variable for cumulative sum
    uint32_t result      = 0;
    uint32_t b17         = 0;
    uint32_t masked_buff = 0;
    while (buffer != _end_buffers[3][0])  // do until buffer reaches one of the saved states
    {
        b17         = buffer & 0x00000001;           // save the "newest" bit of the buffer
        buffer      = (buffer & (0x0001FFFE)) >> 1;  // shift the buffer right, backwards in time
        masked_buff = (buffer) & (_polynomials[3]);  // mask the buffer w/ the selected polynomial
        for (ii = 0; ii < 17; ii++) {
            result = result ^ (((masked_buff) >> ii) & (0x00000001));  // cumulative sum of buffer&poly
        }
        result = result ^ b17;
        buffer = buffer | (result << 16);  // update buffer w/ result
        result = 0;                        // reset result
        count++;
        if ((buffer ^ _end_buffers[3][1]) == 0x00000000) {
            count  = count + 8192 - 1;
            buffer = _end_buffers[3][0];
        }
        if ((buffer ^ _end_buffers[3][2]) == 0x00000000) {
            count  = count + 16384 - 1;
            buffer = _end_buffers[3][0];
        }
        if ((buffer ^ _end_buffers[3][3]) == 0x00000000) {
            count  = count + 24576 - 1;
            buffer = _end_buffers[3][0];
        }
        if ((buffer ^ _end_buffers[3][4]) == 0x00000000) {
            count  = count + 32768 - 1;
            buffer = _end_buffers[3][0];
        }
        if ((buffer ^ _end_buffers[3][5]) == 0x00000000) {
            count  = count + 40960 - 1;
            buffer = _end_buffers[3][0];
        }
        if ((buffer ^ _end_buffers[3][6]) == 0x00000000) {
            count  = count + 49152 - 1;
            buffer = _end_buffers[3][0];
        }
        if ((buffer ^ _end_buffers[3][7]) == 0x00000000) {
            count  = count + 57344 - 1;
            buffer = _end_buffers[3][0];
        }
        if ((buffer ^ _end_buffers[3][8]) == 0x00000000) {
            count  = count + 65536 - 1;
            buffer = _end_buffers[3][0];
        }
        if ((buffer ^ _end_buffers[3][9]) == 0x00000000) {
            count  = count + 73728 - 1;
            buffer = _end_buffers[3][0];
        }
        if ((buffer ^ _end_buffers[3][10]) == 0x00000000) {
            count  = count + 81920 - 1;
            buffer = _end_buffers[3][0];
        }
        if ((buffer ^ _end_buffers[3][11]) == 0x00000000) {
            count  = count + 90112 - 1;
            buffer = _end_buffers[3][0];
        }
        if ((buffer ^ _end_buffers[3][12]) == 0x00000000) {
            count  = count + 98304 - 1;
            buffer = _end_buffers[3][0];
        }
        if ((buffer ^ _end_buffers[3][13]) == 0x00000000) {
            count  = count + 106496 - 1;
            buffer = _end_buffers[3][0];
        }
        if ((buffer ^ _end_buffers[3][14]) == 0x00000000) {
            count  = count + 114688 - 1;
            buffer = _end_buffers[3][0];
        }
        if ((buffer ^ _end_buffers[3][15]) == 0x00000000) {
            count  = count + 122880 - 1;
            buffer = _end_buffers[3][0];
        }
    }
    return count;
}

